tests/artillery.yaml
config:
  target: https://api.pencilectric.org
  http:
    defaults:
      headers:
        x-api-key: "123456"
        Accept-Encoding: gzip, deflate
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: "/plume/teemii.mangas/"
              # url: "/mangas/search?q=Pick%20me%20up"
        count: 100